tap "aws/tap"
tap "fluxcd/tap"
tap "go-task/tap"
tap "helm/tap"
tap "homebrew/bundle"
tap "johanhaleby/kubetail"
tap "oktadeveloper/tap"
tap "nikitabobko/tap"
tap "warrensbox/tap"
tap "env0/terratag"
tap "siderolabs/tap"
brew "age"
brew "aws-vault"
brew "awscli"
brew "antidote"
brew "chart-testing"
brew "circleci"
brew "direnv"
brew "eza"
brew "fluent-bit"
brew "fzf"
brew "git"
brew "gnutls"
brew "gnupg"
brew "go"
brew "hadolint"
brew "helm"
brew "htop"
brew "ipcalc"
brew "iperf"
brew "iperf3"
brew "jq"
brew "k9s"
brew "kind"
brew "kubernetes-cli"
brew "kubectx"
brew "kubeval"
brew "kustomize"
brew "luarocks"
brew "macchina"
brew "maven"
brew "neovim"
brew "nmap"
brew "node", link: true
brew "node@18", link: false
brew "pinentry-mac"
brew "pre-commit"
brew "pyenv"
brew "shellcheck"
brew "sops"
brew "starship"
brew "stow"
brew "terraform-docs"
brew "tflint"
brew "tmux"
brew "yamllint"
brew "yq"
brew "zsh"
brew "aws/tap/eks-node-viewer"
brew "fluxcd/tap/flux"
brew "go-task/tap/go-task"
brew "helm/tap/chart-releaser"
brew "jesseduffield/lazygit/lazygit"
brew "johanhaleby/kubetail/kubetail", args: ["with-short-names"]
brew "robscott/tap/kube-capacity"
brew "warrensbox/tap/tfswitch"
brew "env0/terratag/terratag"
cask "okta"
brew "siderolabs/tap/talosctl"
cask "aerospace"
cask "wezterm"
cask "font-hack-nerd-font"
cask "font-meslo-lg-nerd-font"