tap "aws/tap"
tap "fluxcd/tap"
tap "go-task/tap"
tap "helm/tap"
tap "homebrew/bundle"
tap "oktadeveloper/tap"
tap "warrensbox/tap"
tap "env0/terratag"
tap "siderolabs/tap"
brew "aws-vault"
brew "awscli"
brew "chart-testing"
brew "circleci"
brew "fluent-bit"
brew "fzf"
brew "git"
brew "gnutls"
brew "gnupg"
brew "go"
brew "hadolint"
brew "helm"
brew "jq"
brew "k9s"
brew "kind"
brew "kubernetes-cli"
brew "kubectx"
brew "kubeval"
brew "kustomize"
brew "maven"
brew "node", link: true
brew "node@18", link: false
brew "pinentry-mac"
brew "pre-commit"
brew "pyenv"
brew "shellcheck"
brew "terraform-docs"
brew "tflint"
brew "yamllint"
brew "yq"
brew "zsh"
brew "aws/tap/eks-node-viewer"
brew "fluxcd/tap/flux"
brew "go-task/tap/go-task"
brew "helm/tap/chart-releaser"
brew "warrensbox/tap/tfswitch"
brew "env0/terratag/terratag"
cask "okta"
brew "siderolabs/tap/talosctl"
