tap "fluxcd/tap"
tap "go-task/tap"
tap "helm/tap"
tap "homebrew/bundle"
tap "oktadeveloper/tap"
tap "warrensbox/tap"
brew "aws-vault"
brew "awscli"
brew "fzf"
brew "git"
brew "gnupg"
brew "go"
brew "helm"
brew "kubernetes-cli"
brew "kubectx"
brew "kubeval"
brew "kustomize"
brew "pinentry-mac"
brew "pyenv"
brew "zsh"
brew "yq"
brew "jq"
brew "fluxcd/tap/flux"
brew "go-task/tap/go-task"
brew "helm/tap/chart-releaser"
brew "warrensbox/tap/tfswitch"
