tap "aws/tap"
tap "fluxcd/tap"
tap "go-task/tap"
tap "helm/tap"
tap "homebrew/bundle"
tap "oktadeveloper/tap"
tap "warrensbox/tap"
brew "aws-vault"
brew "awscli"
brew "chart-testing"
brew "circleci"
brew "fluent-bit"
brew "fzf"
brew "git"
brew "gnutls"
brew "gnupg"
brew "go"
brew "hadolint"
brew "helm"
brew "jq"
brew "k9s"
brew "kind"
brew "kubernetes-cli"
brew "kubectx"
brew "kubeval"
brew "kustomize"
brew "maven"
brew "node", link: false
brew "node@18", link: true
brew "pinentry-mac"
brew "pre-commit"
brew "pyenv"
brew "shellcheck"
brew "terraform-docs"
brew "tflint"
brew "yamllint"
brew "yq"
brew "zsh"
brew "aws/tap/eks-node-viewer"
brew "fluxcd/tap/flux"
brew "go-task/tap/go-task"
brew "helm/tap/chart-releaser"
brew "warrensbox/tap/tfswitch"
cask "okta"
cask "vscodium"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "Angular.ng-template"
vscode "asciidoctor.asciidoctor-vscode"
vscode "DanielSanMedium.dscodegpt"
vscode "eamodio.gitlens"
vscode "emeraldwalk.RunOnSave"
vscode "GitHub.codespaces"
vscode "GitHub.copilot"
vscode "GitHub.remotehub"
vscode "github.vscode-github-actions"
vscode "GitLab.gitlab-workflow"
vscode "golang.go"
vscode "hashicorp.hcl"
vscode "hashicorp.terraform"
vscode "janisdd.vscode-edit-csv"
vscode "KevinRose.vsc-python-indent"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.black-formatter"
vscode "ms-python.isort"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "njpwerner.autodocstring"
vscode "redhat.ansible"
vscode "redhat.vscode-yaml"
vscode "signageos.signageos-vscode-sops"
vscode "streetsidesoftware.code-spell-checker"
vscode "task.vscode-task"
vscode "twxs.cmake"
vscode "vscode-icons-team.vscode-icons"
vscode "weaveworks.vscode-gitops-tools"
