tap "anomalyco/tap"
tap "aws/tap"
tap "barutsrb/tap"
tap "certak-com/kafkio"
tap "clowdhaus/taps"
tap "dart-lang/dart"
tap "dnd-it/tap"
tap "env0/terratag"
tap "fairwindsops/tap"
tap "fluxcd/tap"
tap "go-task/tap"
tap "gromgit/brewtils"
tap "hcavarsan/kftray"
tap "helm/tap"
tap "infisical/get-cli"
tap "jesseduffield/lazygit"
tap "johanhaleby/kubetail"
tap "lance0/tap"
tap "localstack/tap"
tap "mk-5/mk-5"
tap "mongodb/brew"
tap "nikitabobko/tap"
tap "norwoodj/tap"
tap "oktadeveloper/tap"
tap "robscott/tap"
tap "sass/sass"
tap "siderolabs/tap"
tap "sst/tap"
tap "swibrow/tap"
tap "tj-actions/tap"
tap "vladimirvivien/oss-tools"
tap "warrensbox/tap"
tap "yakitrak/yakitrak"
brew "act"
brew "age"
brew "icu4c@77"
brew "openssl@3"
brew "xz"
brew "node", link: false
brew "angular-cli"
brew "aom"
brew "argocd"
brew "argocd-autopilot"
brew "atuin"
brew "pycparser"
brew "aws-sam-cli"
brew "aws-vault"
brew "awscli"
brew "awscurl"
brew "bash"
brew "bat"
brew "bottom"
brew "btop"
brew "bzip2"
brew "carapace"
brew "chart-releaser"
brew "chart-testing"
brew "chezmoi"
brew "circleci"
brew "cocoapods"
brew "cookiecutter"
brew "coreutils"
brew "direnv"
brew "docker"
brew "docutils"
brew "eksctl"
brew "eza"
brew "fastfetch"
brew "fd"
brew "fluent-bit"
brew "fzf"
brew "gcalcli"
brew "libavif"
brew "gh"
brew "pango"
brew "ghostscript"
brew "git"
brew "glances"
brew "glow"
brew "unbound"
brew "gnutls"
brew "libassuan"
brew "pinentry"
brew "gnupg"
brew "go"
brew "goaccess"
brew "golangci-lint"
brew "librsvg"
brew "graphviz"
brew "gum"
brew "hadolint"
brew "helix"
brew "helm"
brew "hey"
brew "htop"
brew "hugo"
brew "imagemagick"
brew "infracost"
brew "inframap"
brew "ios-deploy"
brew "ipcalc"
brew "iperf"
brew "iperf3"
brew "jira-cli"
brew "jq"
brew "just"
brew "k6"
brew "k9s"
brew "kind"
brew "ktop"
brew "kubebuilder"
brew "kubeconform"
brew "kubectx"
brew "kubernetes-cli"
brew "kubeval"
brew "kubie"
brew "kustomize"
brew "lazygit"
brew "libffi"
brew "libfido2"
brew "libxmlsec1"
brew "llmfit"
brew "localstack"
brew "logstash"
brew "luarocks"
brew "macchina"
brew "make"
brew "mariadb-connector-c"
brew "openjdk"
brew "maven"
brew "mise"
brew "mkcert"
brew "models"
brew "mongosh"
brew "mtr"
brew "mycli"
brew "ncspot"
brew "neofetch"
brew "neovim"
brew "nmap"
brew "python@3.10"
brew "node@14"
brew "node@18"
brew "node@20"
brew "oha"
brew "ollama"
brew "openjdk@17"
brew "parallel"
brew "pgcli"
brew "pinentry-mac"
brew "pipx"
brew "postgresql@14"
brew "postgresql@17", link: true
brew "pre-commit"
brew "pulumi"
brew "pv"
brew "python@3.11"
brew "qrencode"
brew "rainfrog"
brew "renovate"
brew "ripgrep"
brew "sentry-cli"
brew "sesh"
brew "sha2"
brew "shellcheck"
brew "socat"
brew "sops"
brew "starship"
brew "stow"
brew "t-rec"
brew "telnet"
brew "terminal-notifier"
brew "terraform-docs"
brew "tfk8s"
brew "tflint"
brew "the_silver_searcher"
brew "tldr"
brew "tmux"
brew "tree"
brew "tree-sitter"
brew "uv"
brew "valkey"
brew "virtualenv"
brew "watch"
brew "watchman"
brew "websocat"
brew "wget"
brew "wireguard-go"
brew "wireguard-tools"
brew "worktrunk"
brew "yamllint"
brew "yazi"
brew "yq"
brew "zlib"
brew "zoxide"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-fast-syntax-highlighting"
brew "anomalyco/tap/opencode"
brew "aws/tap/eks-node-viewer"
brew "clowdhaus/taps/eksup"
brew "dnd-it/tap/tamedia-tools"
brew "env0/terratag/terratag"
brew "fairwindsops/tap/pluto"
brew "fluxcd/tap/flux", link: false
brew "fluxcd/tap/flux@0.41", link: true
brew "go-task/tap/go-task", link: false
brew "gromgit/brewtils/taproom"
brew "hcavarsan/kftray/kftui"
brew "infisical/get-cli/infisical"
brew "johanhaleby/kubetail/kubetail", args: ["with-short-names"]
brew "lance0/tap/ttl"
brew "mk-5/mk-5/fjira"
brew "norwoodj/tap/helm-docs"
brew "robscott/tap/kube-capacity"
brew "sass/sass/sass"
brew "siderolabs/tap/talosctl"
brew "swibrow/tap/agent-ops"
brew "tj-actions/tap/auto-doc"
brew "yakitrak/yakitrak/obsidian-cli"
cask "nikitabobko/tap/aerospace"
cask "warrensbox/tap/tfswitch"
cask "amethyst"
cask "aptakube"
cask "balenaetcher"
cask "bruno"
cask "codex"
cask "container"
cask "docker-desktop"
cask "expo-orbit"
cask "finicky"
cask "font-hack-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "gcloud-cli"
cask "ghostty"
cask "gimp"
cask "hyperkey"
cask "keycastr"
cask "mongodb-compass"
cask "mysqlworkbench"
cask "ngrok"
cask "obs"
cask "oktadeveloper/tap/okta"
cask "barutsrb/tap/omniwm"
cask "pearcleaner"
cask "tailscale-app"
